# task3.py
filename = "user_data.txt" # Використовуємо файл, який ви створили в завданні 2

print(f"Додаємо дані у файл '{filename}'.")
new_line = input("Введіть рядок, який треба додати: ")

# Відкриваємо файл у режимі 'a' (append - додавання)
with open(filename, 'a', encoding='utf-8') as file:
    # Додаємо \n перед текстом, щоб він починався з нового рядка,
    # або в кінці, залежно від того, як закінчився попередній запис.
    file.write(new_line + "\n")

print("Рядок успішно додано! Відкрийте файл і перевірте.")